rushairer/LearnCW32/Libraries/src/cw32f030_rcc.c
}

/**
* @brief  Disable LSI
* @param  None.
* @retval None.
*/
void RCC_LSI_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~ SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & \
                       (~SYSCTRL_CR1_LSIEN_Msk));
}


/**
* @brief  Enable HSE
* @param  Mode:   RCC_HSE_MODE_OSC: Oscillator,
*                 RCC_HSE_MODE_CLK: Input Clk
*
* @param  FreqIn: 4000000Hz ~ 32000000Hz
*
* @param  Driver: RCC_HSE_DRIVER_LEAST,
*                 RCC_HSE_DRIVER_SMALL,
*                 RCC_HSE_DRIVER_NORMAL, (default)
*                 RCC_HSE_DRIVER_LARGER
*
* @param  Flt: RCC_HSE_FLT_OPEN,
*              RCC_HSE_FLT_CLOSE
*
* @retval None

16M驱动配置建议：
Range:  建议配置为2
Driver：建议配置为1或者2

24M驱动配置建议：
Range:  建议配置为3
Driver：建议配置为1

32M驱动配置建议：
Range:  建议配置为3
Driver：建议配置为2

注意：1、选择负载电容小的晶体更容易起振。
2、Flt: 强干扰环境打开,一般不打开
*/
int RCC_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt)
{
    uint8_t freqRange = 0;
    uint16_t timeout = 0xffff;
    //参数断言
    assert_param(IS_RCC_HSE_MODE(Mode));
    assert_param(IS_RCC_HSE_FREQIN(FreqIn));  //FPGA测试注释掉，正式版打开
    assert_param(IS_RCC_HSE_DRIVER(Driver));
    assert_param(IS_RCC_HSE_FLT(Flt));
    //根据HSE模式设置IO口功能
    CW_SYSCTRL->AHBEN |= SYSCTRL_AHBEN_GPIOF_Msk; //Open GPIOF Clk
    if (Mode == RCC_HSE_MODE_OSC)                 //Oscillator
    {
        CW_GPIOF->ANALOG |= (bv0 | bv1);          //PF00 PF01 as analog pin
    }
    else                                          //Input clk
    {
        CW_GPIOF->ANALOG &= ~bv0;                 //PF00 as input clk pin
        CW_GPIOF->DIR    |=  bv0;                 //PF00 input
        CW_GPIOF->PUR    &= ~bv0;
        CW_GPIOF->PDR    |=  bv0;
    }
    //根据输入频率参数得到对应设置值
    freqRange = (FreqIn == 32000000) ? 0x3UL : (FreqIn / 8000000);
    //设置HSE参数
    CW_SYSCTRL->HSE = ((8000000000 / FreqIn) << 8)                     | \
                      (Mode                                            | \
                       (RCC_HSE_WAITCYCLE_131072)                      | \
                       (((uint32_t)freqRange << SYSCTRL_HSE_FREQRANGE_Pos)) | \
                       (Driver) | \
                       (Flt));
    //使能HSE,同时使能CLKCCS和HSECCS，使能时钟失效切换
    CW_SYSCTRL->CR1 |= SYSCTRL_BYPASS | RCC_SYSCTRL_CLKCCS | SYSCTRL_CR1_HSECCS_Msk | SYSCTRL_CR1_HSEEN_Msk;  //Enable HSE
    //等待HSE稳定
    while (((CW_SYSCTRL->HSE & SYSCTRL_HSE_STABLE_Msk) != SYSCTRL_HSE_STABLE_Msk) && timeout--);        //Wait stable
    if (timeout == 0) return 1;
    return 0;
}

/**
* @brief  Disable HSE
* @param  None.
* @retval None.
*/
void RCC_HSE_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~ SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & \
                       (~SYSCTRL_CR1_HSEEN_Msk));
}

/**
* @brief  Enable LSE
* @param  Mode:   RCC_LSE_MODE_OSC: Oscillator,
*                 RCC_LSE_MODE_CLK: Input Clk
* @param  Amp:    RCC_LSE_AMP_LEAST, RCC_LSE_AMP_SMALL
*                 RCC_LSE_AMP_NORMAL，RCC_LSE_AMP_LARGER
* @param  Driver: RCC_LSE_DRIVER_LEAST, RCC_LSE_DRIVER_SMALL
*                 RCC_LSE_DRIVER_NORMAL，RCC_LSE_DRIVER_LARGER
*
* @retval None

驱动配置建议：
AMP:    建议配置为2（RCC_LSE_AMP_NORMAL）或3（RCC_LSE_AMP_LARGER）
Driver：建议配置为3（RCC_LSE_DRIVER_LARGER）
*/
int RCC_LSE_Enable(uint32_t Mode, uint8_t Amp, uint8_t Driver)
{
    uint16_t timeout = 0xffff;
    //参数断言
    assert_param(IS_RCC_LSE_MODE(Mode));
    assert_param(IS_RCC_LSE_AMP(Amp));
    assert_param(IS_RCC_LSE_DRIVER(Driver));
    //根据LSE模式，设置IO功能
    CW_SYSCTRL->AHBEN |= SYSCTRL_AHBEN_GPIOC_Msk; //Open GPIOC clk
    if (Mode == RCC_LSE_MODE_OSC)                 //Oscillator
    {
        CW_GPIOC->ANALOG |= (bv15 | bv14);        //PC15 PC14 as analog pin
    }
    else                                          //Input clk
    {
        CW_GPIOC->ANALOG &= ~bv14;                //PC14 as input clk pin
        CW_GPIOC->DIR    |=  bv14;                //PC14 input
        CW_GPIOC->PUR    &=  bv14;
        CW_GPIOC->PDR    |=  bv14;
    }
    //设置LSE参数
    CW_SYSCTRL->LSE = ((Mode)                    | \
                       (RCC_LSE_WAITCYCLE_16384) | \
                       (Amp)                     | \
                       (Driver));
    //LSE使能,同时使能CLKCCS和LSECCS，使能时钟失效切换
    CW_SYSCTRL->CR1 |= SYSCTRL_BYPASS | RCC_SYSCTRL_CLKCCS | SYSCTRL_CR1_LSECCS_Msk | SYSCTRL_CR1_LSEEN_Msk;                    //Enable LSE
    //等待LSE稳定
    while (((CW_SYSCTRL->LSE & SYSCTRL_LSE_STABLE_Msk) != SYSCTRL_LSE_STABLE_Msk) && timeout--);//Wait stable
    if (timeout == 0) return 1;
    return 0;
}

/**
* @brief  Disable LSE
* @param  None
* @retval None
*/
void RCC_LSE_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~ SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & \
                       (~SYSCTRL_CR1_LSEEN_Msk));
}

/**
* @brief  Enable PLL
* @param  PLLSource:
                     RCC_PLLSOURCE_HSEOSC,
                     RCC_PLLSOURCE_HSECLK,
                     RCC_PLLSOURCE_HSI
* @param  FreqIn:    4000000Hz ~ 24000000Hz
* @param  PLLMul:    2~12
* @retval  None
*/
int RCC_PLL_Enable(uint32_t PLLSource, uint32_t FreqIn, uint32_t PLLMul)
{
    uint8_t  i = 0;
    uint32_t freqInMsk = 0;
    uint32_t freqOutMsk = 0;
    uint32_t freqInTable[4]  = { 6000000, 12000000, 20000000, 24000001 };
    //uint32_t freqInTable[4]  = { 6000000 , 12000000, 20000000, 32000001 }; //FPGA测试打开
    uint32_t freqOutTable[5] = { 18000000, 24000000, 36000000, 48000000, 72000001 };
    uint16_t timeout = 0xffff;
    //参数断言
    assert_param(IS_RCC_PLLSOURCE(PLLSource));
    assert_param(IS_RCC_PLL_FREQIN(FreqIn));  //FPGA测试注释掉，正式版打开
    assert_param(IS_RCC_PLL_MUL(PLLMul));
    //计算FREQIN设置值
    for (i = 0; i < (sizeof(freqInTable) / sizeof(freqInTable[0])); i++)
    {
        if (FreqIn < freqInTable[i])
        {
            freqInMsk = i;
            break;
        }
    }
    ////计算FREQOUT设置值
    freqOutMsk = FreqIn * PLLMul;
    for (i = 0; i < (sizeof(freqOutTable) / sizeof(freqOutTable[0])); i++)
    {
        if (freqOutMsk < freqOutTable[i])
        {
            freqOutMsk = i;
            break;
        }
    }
    //设置PLL参数
    CW_SYSCTRL->PLL = (RCC_PLL_WAITCYCLE_16384                                | \
                       ((uint32_t)(freqOutMsk << SYSCTRL_PLL_FREQOUT_Pos))  | \
                       ((uint32_t)(PLLMul     << SYSCTRL_PLL_MUL_Pos))  | \
                       ((uint32_t)(freqInMsk  << SYSCTRL_PLL_FREQIN_Pos))  | \
                       ((uint32_t)(PLLSource  << SYSCTRL_PLL_SOURCE_Pos)));
    //使能PLL
    CW_SYSCTRL->CR1 |= SYSCTRL_BYPASS | SYSCTRL_CR1_PLLEN_Msk;     //Enable PLL
    //等待PLL时钟稳定
    while (((CW_SYSCTRL->PLL & SYSCTRL_PLL_STABLE_Msk) != SYSCTRL_PLL_STABLE_Msk) && timeout--);
    if (timeout == 0) return 1;
    return 0;
}

/**
* @brief  Disable PLL
* @param  None
* @retval None
*/
void RCC_PLL_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1  & (~ SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & \
                       (~SYSCTRL_CR1_PLLEN_Msk));
}

/**
* @brief  CLKSRC switch
* @param  NewClk:
*                RCC_SYSCLKSRC_HSI,
*                RCC_SYSCLKSRC_HSE,
*                RCC_SYSCLKSRC_PLL,
*                RCC_SYSCLKSRC_LSI,
*                RCC_SYSCLKSRC_LSE
* @retval 0: PASS, 1: Fail
*
* NOTE:调用此函数之前需要保证新时钟源已经使能（ENABLE函数中已包含等待时钟稳定过程）。
*/

